/* 
1. Callback & Higher-Order Function มีข้อดีอย่างไร
Answer: สามารถ เอา code มาใช้ซ้ำๆ และ การเขียน code ค่อนข้างสั้นและกระชับ


2. จากการลองใช้ Callback Function ในระบบเกมและระบบแจ้งเตือน คุณคิดว่าโค้ดอ่านง่ายขึ้นหรือไม่ เพราะอะไร 
Answer: อาจจะ งงๆปวดหัวหน่อยๆ กับตอนแรกๆเพราะยังใหม่ แต่พอเข้าใจแล้ว จะง่ายขึ้น และ เขียนได้ใจความและสั้นลงกว่าเดิมเยอะ


3. หากต้องสอนเพื่อนให้เข้าใจ Callback & Higher-Order Function ใน 5 นาที จะอธิบายอย่างไร 
Answer:  HOF คือ ฟังชั่น ที่เรียกฟังชั่นมาใช้อีกที


*/
